jeacelo/CC3200-IoT/main.c
/*Message Queue*/
OsiMsgQ_t g_PBQueue;

/* connection configuration */
connect_config usr_connect_config[] =
{
    {
        {
            {
                SL_MQTT_NETCONN_URL,
                SERVER_ADDRESS,
                PORT_NUMBER,
                0,
                0,
                0,
                NULL
            },
            SERVER_MODE,
            true,
        },
        NULL,
        (unsigned char *)"user1",
        NULL,
        NULL,
        true,
        KEEP_ALIVE_TIMER,
        {Mqtt_Recv, sl_MqttEvt, sl_MqttDisconnect},
        TOPIC_COUNT,
        {TOPIC1, TOPIC2, TOPIC3,TOPIC_JSON}, /* Tantos como TOPIC_COUNT */
        {QOS2, QOS2, QOS2,QOS2}, /* Tantos como topics */
        {WILL_TOPIC,WILL_MSG,WILL_QOS,WILL_RETAIN},
        false
    }
};

/* library configuration */
SlMqttClientLibCfg_t Mqtt_Client={
    1882,
    TASK_PRIORITY,
    30,
    true,
    (long(*)(const char *, ...))UART_PRINT
};

/*Publishing topics and messages*/
const char *pub_topic_sw2 = PUB_TOPIC_FOR_SW2;
const char *pub_topic_sw3 = PUB_TOPIC_FOR_SW3;
const char *pub_topic_json = PUB_TOPIC_JSON;
const unsigned char *data_sw2={"Push button sw2 is pressed on CC32XX device"};
const unsigned char *data_sw3={"Push button sw3 is pressed on CC32XX device"};

void *app_hndl = (void*)usr_connect_config;
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************

//****************************************************************************
//! Defines Mqtt_Pub_Message_Receive event handler.
//! Client App needs to register this event handler with sl_ExtLib_mqtt_Init 
//! API. Background receive task invokes this handler whenever MQTT Client 
//! receives a Publish Message from the broker.
//!
//!\param[out]     topstr => pointer to topic of the message
//!\param[out]     top_len => topic length
//!\param[out]     payload => pointer to payload
//!\param[out]     pay_len => payload length
//!\param[out]     retain => Tells whether its a Retained message or not
//!\param[out]     dup => Tells whether its a duplicate message or not
//!\param[out]     qos => Tells the Qos level
//!
//!\return none
//****************************************************************************
static void
Mqtt_Recv(void *app_hndl, const char  *topstr, long top_len, const void *payload,
                       long pay_len, bool dup,unsigned char qos, bool retain)
{
    
	bool booleano;
    char *output_str=(char*)pvPortMalloc(top_len+1);
    memset(output_str,'\0',top_len+1);
    strncpy(output_str, (char*)topstr, top_len);
    output_str[top_len]='\0';


    if(strncmp(output_str,TOPIC1, top_len) == 0)
    {
    	if (json_scanf((const char *)payload, pay_len, "{ Led: %B }", &booleano)>0)
    	{
    		if (booleano)
    			GPIO_IF_LedOn(MCU_RED_LED_GPIO);
    		else
    			GPIO_IF_LedOff(MCU_RED_LED_GPIO);
    	}
    }
    else if(strncmp(output_str,TOPIC2, top_len) == 0)
    {
    	if (json_scanf((const char *)payload, pay_len, "{ Led: %B }", &booleano)>0)
    	{
    		if (booleano)
    			GPIO_IF_LedOn(MCU_ORANGE_LED_GPIO);
    		else
    			GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);
    	}
    }
    else if(strncmp(output_str,TOPIC3, top_len) == 0)
    {
    	if (json_scanf((const char *)payload, pay_len, "{ Led: %B }", &booleano)>0)
    	{
    		if (booleano)
    			GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);
    		else
    			GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
    	}
    }
    else if (strncmp(output_str,TOPIC_JSON, top_len) == 0)
	{
    	//JMCG: Ejemplo de parseo JSON....
    	if (json_scanf((const char *)payload, pay_len, "{ redLed: %B }", &booleano)>0)
    	{

    		if (booleano)
    			GPIO_IF_LedOn(MCU_RED_LED_GPIO);
    		else
    			GPIO_IF_LedOff(MCU_RED_LED_GPIO);

    	}
    	if (json_scanf((const char *)payload, pay_len, "{ greenLed: %B }", &booleano)>0)
    	{

    		if (booleano)
    			GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);
    		else
    			GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);

    	}
	}

    UART_PRINT("\n\rPublish Message Received");
    UART_PRINT("\n\rTopic: ");
    UART_PRINT("%s",output_str);
    vPortFree(output_str);
    UART_PRINT(" [Qos: %d] ",qos);
    if(retain)
      UART_PRINT(" [Retained]");
    if(dup)
      UART_PRINT(" [Duplicate]");
    
    output_str=(char*)pvPortMalloc(pay_len+1);
    memset(output_str,'\0',pay_len+1);
    strncpy(output_str, (char*)payload, pay_len);
    output_str[pay_len]='\0';
    UART_PRINT("\n\rData is: ");
    UART_PRINT("%s",(char*)output_str);
    UART_PRINT("\n\r");
    vPortFree(output_str);
    
    return;
}

//****************************************************************************
//! Defines sl_MqttEvt event handler.
//! Client App needs to register this event handler with sl_ExtLib_mqtt_Init 
//! API. Background receive task invokes this handler whenever MQTT Client 
//! receives an ack(whenever user is in non-blocking mode) or encounters an error.
//!
//! param[out]      evt => Event that invokes the handler. Event can be of the
//!                        following types:
//!                        MQTT_ACK - Ack Received 
//!                        MQTT_ERROR - unknown error
//!                        
//!  
//! \param[out]     buf => points to buffer
//! \param[out]     len => buffer length
//!       
//! \return none
//****************************************************************************
static void
sl_MqttEvt(void *app_hndl, long evt, const void *buf,unsigned long len)
{
    int i;
    switch(evt)
    {
      case SL_MQTT_CL_EVT_PUBACK:
        UART_PRINT("PubAck:\n\r");
        UART_PRINT("%s\n\r",buf);
        break;
    
      case SL_MQTT_CL_EVT_SUBACK:
        UART_PRINT("\n\rGranted QoS Levels are:\n\r");
        
        for(i=0;i<len;i++)
        {
          UART_PRINT("QoS %d\n\r",((unsigned char*)buf)[i]);
        }
        break;
        
      case SL_MQTT_CL_EVT_UNSUBACK:
        UART_PRINT("UnSub Ack \n\r");
        UART_PRINT("%s\n\r",buf);
        break;
    
      default:
        break;
  
