jeacelo/CC3200-IoT/main.c
	volatile uint8_t ui8SPIDone;
	static uint8_t pui8Colors[NUM_LEDS][3];

	    //
	    // The output array for the SPI bus.  The nature of the timing for the LEDs
	    // makes it so we can't just map a single intensity byte onto a single byte
	    // to transmit out the SPI peripheral.  Instead, we separate each bit of
	    // the intensity to four bits of SPI out.  The WS one wire protocol
	    // basically boils down to "110" on the SPI bus is read as a 1 by the LED,
	    // "100" is a 0.  We use some macros to figure out how many bytes of SPI
	    // array we need to represent each of the 30 LEDs.
	    //
	    static uint8_t pui8SPIOut[NUM_LEDS][WS2812_SPI_BYTE_PER_CLR *
	                                  WS2812_SPI_BIT_WIDTH];


	    InitRGBSPI(); //Aqui o en el MAIN...

	    rainbowInit(pui8Colors, NUM_LEDS);
	    WSArrayInit(pui8SPIOut, sizeof(pui8SPIOut));

	    //
	    // Initialize and start the inifinite uDMA transfers
	    //
	    InitSPITransfer((uint8_t*)pui8SPIOut, sizeof(pui8SPIOut));

	while(1)
	{
		int i,j;

		for (j=0;j<NUM_LEDS;j++)
		{
			waitSPITramsfer();
			osi_Sleep(100);


			for(i=0;i<NUM_LEDS;i++)
			{
				//
				//            //
				//            // Update the RGB colors to the next value in the color wheel
				//            //
				//        		rainbowShift(&(pui8Colors[i][0]), &(pui8Colors[i][1]),
				//                         &(pui8Colors[i][2]));
				//
				if((j+i)<NUM_LEDS)
				{
					WSGRBtoSPI(pui8SPIOut[i], pui8Colors[j+i][0],
							pui8Colors[j+i][1], pui8Colors[j+i][2]);
				}
				else
				{
					WSGRBtoSPI(pui8SPIOut[i], pui8Colors[j+i-NUM_LEDS][0],
												pui8Colors[j+i-NUM_LEDS][1], pui8Colors[j+i-NUM_LEDS][2]);
				}

			}
			InitSPITransfer((uint8_t*)pui8SPIOut, sizeof(pui8SPIOut));
		}

	}
}






//GLOBAL PARA DE MOMENTO NO GASTAR PILA (CUIDADO!!!)
char json_buffer[100];
//struct json_out out1 = JSON_OUT_BUF(json_buffer, sizeof(json_buffer));


#ifndef STATION_MODE
//MQTT Task (Para el caso en el que no estoy en modo "STATION"
#ifdef __cplusplus
extern "C" {
void MqttClientTask(void *pvParameters);
}
#endif /* __cplusplus */

void MqttClientTask(void *pvParameters)
{
	long lRetVal = -1;
	int iCount = 0;
	    int iNumBroker = 0;
	    int iConnBroker = 0;
	    osi_messages RecvQue;

	    connect_config *local_con_conf = (connect_config *)app_hndl;

	//
	    // Initialze MQTT client lib
	    //
	    lRetVal = sl_ExtLib_MqttClientInit(&Mqtt_Client);
	    if(lRetVal != 0)
	    {
	        // lib initialization failed
	        UART_PRINT("MQTT Client lib initialization failed\n\r");
	        LOOP_FOREVER();
	    }

	    /******************* connection to the broker ***************************/
	    iNumBroker = sizeof(usr_connect_config)/sizeof(connect_config);
	    if(iNumBroker > MAX_BROKER_CONN)
	    {
	        UART_PRINT("Num of brokers are more then max num of brokers\n\r");
	        LOOP_FOREVER();
	    }

	    while(iCount < iNumBroker)
	    {
	        //create client context
	        local_con_conf[iCount].clt_ctx =
	        sl_ExtLib_MqttClientCtxCreate(&local_con_conf[iCount].broker_config,
	                                      &local_con_conf[iCount].CallBAcks,
	                                      &(local_con_conf[iCount]));

	        //
	        // Set Client ID
	        //
	        sl_ExtLib_MqttClientSet((void*)local_con_conf[iCount].clt_ctx,
	                            SL_MQTT_PARAM_CLIENT_ID,
	                            local_con_conf[iCount].client_id,
	                            strlen((char*)(local_con_conf[iCount].client_id)));

	        //
	        // Set will Params
	        //
	        if(local_con_conf[iCount].will_params.will_topic != NULL)
	        {
	            sl_ExtLib_MqttClientSet((void*)local_con_conf[iCount].clt_ctx,
	                                    SL_MQTT_PARAM_WILL_PARAM,
	                                    &(local_con_conf[iCount].will_params),
	                                    sizeof(SlMqttWill_t));
	        }

	        //
	        // setting username and password
	        //
	        if(local_con_conf[iCount].usr_name != NULL)
	        {
	            sl_ExtLib_MqttClientSet((void*)local_con_conf[iCount].clt_ctx,
	                                SL_MQTT_PARAM_USER_NAME,
	                                local_con_conf[iCount].usr_name,
	                                strlen((char*)local_con_conf[iCount].usr_name));

	            if(local_con_conf[iCount].usr_pwd != NULL)
	            {
	                sl_ExtLib_MqttClientSet((void*)local_con_conf[iCount].clt_ctx,
	                                SL_MQTT_PARAM_PASS_WORD,
	                                local_con_conf[iCount].usr_pwd,
	                                strlen((char*)local_con_conf[iCount].usr_pwd));
	            }
	        }

	        //
	        // connectin to the broker
	        //
	        if((sl_ExtLib_MqttClientConnect((void*)local_con_conf[iCount].clt_ctx,
	                            local_con_conf[iCount].is_clean,
	                            local_con_conf[iCount].keep_alive_time) & 0xFF) != 0)
	        {
	            UART_PRINT("\n\rBroker connect fail for conn no. %d \n\r",iCount+1);

	            //delete the context for this connection
	            sl_ExtLib_MqttClientCtxDelete(local_con_conf[iCount].clt_ctx);

	            break;
	        }
	        else
	        {
	            UART_PRINT("\n\rSuccess: conn to Broker no. %d\n\r ", iCount+1);
	            local_con_conf[iCount].is_connected = true;
	            iConnBroker++;
	        }

	        //
	        // Subscribe to topics
	        //

	        if(sl_ExtLib_MqttClientSub((void*)local_con_conf[iCount].clt_ctx,
	                                   local_con_conf[iCount].topic,
	                                   local_con_conf[iCount].qos, TOPIC_COUNT) < 0)
	        {
	            UART_PRINT("\n\r Subscription Error for conn no. %d\n\r", iCount+1);
	            UART_PRINT("Disconnecting from the broker\r\n");
	            sl_ExtLib_MqttClientDisconnect(local_con_conf[iCount].clt_ctx);
	            local_con_conf[iCount].is_connected = false;

	            //delete the context for this connection
	            sl_ExtLib_MqttClientCtxDelete(local_con_conf[iCount].clt_ctx);
	            iConnBroker--;
	            break;
	        }
	        else
	        {
	            int iSub;
	            UART_PRINT("Client subscribed on following topics:\n\r");
	            for(iSub = 0; iSub < local_con_conf[iCount].num_topics; iSub++)
	            {
	                UART_PRINT("%s\n\r", local_con_conf[iCount].topic[iSub]);
	            }
	        }
	        iCount++;
	    }

	    if(iConnBroker < 1)
	    {
	        //
	        // no succesful connection to broker
	        //
	        goto end;
	    }

	    iCount = 0;

	    for(;;)
	    {
	        osi_MsgQRead( &g_PBQueue, &RecvQue, OSI_WAIT_FOREVER);

	        if(PUSH_BUTTON_SW2_PRESSED == RecvQue)
	        {
	            Button_IF_EnableInterrupt(SW2);
	            //
	            // send publish message
	            //
	            sl_ExtLib_MqttClientSend((void*)local_con_conf[iCount].clt_ctx,
	                    pub_topic_sw2,data_sw2,strlen((char*)data_sw2),QOS2,RETAIN);

	            struct json_out out1 = JSON_OUT_BUF(json_buffer, sizeof(json_buffer));//Reinicio out1, de lo contrario se van acumulando los printfs

	            json_printf(&out1,"{ boton : %B}",false);



	                    sl_ExtLib_MqttClientSend((void*)local_con_conf[iCount].clt_ctx,
	                    		pub_topic_json,json_buffer,strlen((char*)json_buffer),QOS2,RETAIN);
	            UART_PRINT("\n\r CC3200 Publishes the following message \n\r");
	            UART_PRINT("Topic: %s\n\r",pub_topic_sw2);
	            UART_PRINT("Data: %s\n\r",data_sw2);
	        }
	        else if(PUSH_BUTTON_SW3_PRESSED == RecvQue)
	        {
	            Button_IF_EnableInterrupt(SW3);
	            //
	            // send publish message
	            //
	            sl_ExtLib_MqttClientSend((void*)local_con_conf[iCount].clt_ctx,
	                    pub_topic_sw3,data_sw3,strlen((char*)data_sw3),QOS2,RETAIN);

	            struct json_out out1 = JSON_OUT_BUF(json_buffer, sizeof(json_buffer));

	            //Reinicio out1, de lo contrario se van acumulando los printfs

